using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Quest
{
    public string name, info;
    public int level, list;
    public int goal;
    public int reward;
}

public class MainQuest : Quest
{
    private static Sprite[] sprites;
    private static bool isInit;

    private static string[] infos =
    {
        "< 땅파서 돈벌기 > 게임에 어서와! 일단 돈을 벌기 위해선 땅을 파야겠지?\n\n(TMI.땅을 파기 위해선 왼쪽 상단에 '땅파러 가기' 클릭!)",
        "오! 의외로 땅을 잘 파는데? 이제 땅 속에 있는 < 광물 > 을 채광해보자!",
        "광물을 캐다보니 < 이상한 슬라임> 들이 나왔어! 이녀석들 때문에 내가 광물을 캘 수 없잖아? 불쌍하지만 모두 처리하는 방법 밖에 없겠어.",
        "잘했어! 그나저나 땅 속에서 < 던전 > 을 본 적 있어? 거기엔 < 던전 상자 > 가 있는데 열어 보면 많은 광물을 준다고 하더라! 한 번 상자를 열어볼까?",

        "로비에 [ 상점 ] 버튼이 활성화 됐어! 이제 이때까지 모은 광물을 팔아볼까?",
        "좋아! 이제 나한테도 돈이 생겼어! 이 돈으로 < 돌 장비 세트 > 를 구매해보자!",
        "드디어 제대로 된 광부가 된 것 같아! 이번에는 더 깊이 들어가서 더 좋은 광물을 채광해보자!",

        "로비에 [ 인벤토리 ] 버튼이 활성화 됐어! 인벤토리에선 플레이어의 스텟을 확인할 수 있고 < 강화 > 를 할 수 있지! 먼저 몬스터와 상자에서 얻은 < EXP > 로 경험치 강화를 해보자!",
        "이번에는 < 강화석 > 으로 강화석 강화를 해볼까? (필독!) 강화석 강화를 많이 할수록 장비의 [ 등급 ] 을 올릴 수 있어! 그럼 더 높은 등급의 광물에 효과를 적용할 수 있지! 그럼 이제 장비들을 강화해보자.\n\n(TMI.인벤토리에서 강화석 강화 4회를 하면 레어 등급이 됩니다!)",

        "로비에 [ 업적 ] 버튼이 활성화 됐어! 업적에는 다양한 도전 성과나 공적이 존재하지. 업적을 깰 수록 작은 보상을 얻을 수 있고 티어를 높일수록 큰 보상을 얻을 수 있어!",
        "이번에는 업적 티어 보상을 받아보자! 티어가 올라갈수록 더 좋은 보상을 얻을 수 있다고?",

        "로비에 [ 컬렉션 ] 버튼이 활성화 됐어! 광물을 캐다보면 적은 확률로 < 컬렉션 카드 > 가 떨어지지! 각 광물마다 < 광물 컬렉션 효과 >가 존재하거든! 그리고 층마다 존재하는 컬렉션 카드의 레벨 합에 따라 < 플로어 컬렉션 효과 > 가 부여될 수 있어! 한번 모아보도록 할까?",
        "좋았어. 그런데 슬슬 더 좋은 장비를 착용할 필요가 있을 것 같아! < 철 장비 세트 > 를 구매해보자!",
        "장비를 구매했다면 강화는 필수! 3층부터는 높은 등급의 광물이 더 많이 나오지! 이번에는 < 에픽 > 등급까지 강화해보자!\n\n(TMI.인벤토리에서 강화석 강화 8회를 하면 에픽 등급이 됩니다)",
        "경험치 강화도 빼먹을 수 없지! 나에게 부족하다고 생각하는 효과를 EXP를 지불해 강화해보자!",
        "이제 < 에픽 > 등급 광물을 캘 준비는 끝났어! 어디 한번 값비싼 < 에픽 > 광물을 채광해볼까?!",

        "인벤토리와 땅에서 [ 아이템 가방 ] 버튼이 활성화 됐어! 아이템에는 < 물약 아이템 > 과 < 강화 아이템 > 2가지가 있어. 물약 아이템은 일정 시간동안 능력치를 올려주고, 강화 아이템은 강화석 강화를 좀 더 쉽게 해줄 수 있도록 해주지. 일단 < 물약 아이템 > 을 사용해보자!",
        "물약의 효과는 어때? 조금 도움이 되는 것 같아? 이번에는 < 강화 아이템 > 을 사용해보자.",
        "혹시 땅 속에서 위험해보이는 건축물을 본 적 있어?! 조금 깊은 곳에는 < 유적 던전 > 이라는 무시무시한 던전이 등장할 수 있다고? 한번 들어가 볼래?!",
        "유적 던전에 들어간 소감이 어때? 어두워서 무섭기도 하고 강력한 몬스터들이 많지? 적응됐다면 한번 녀석들을 해치워볼까?",
        "혹시 유적 던전에서 거대한 상자를 본 적 있어? < 유적 던전 상자 > 는 비싼 광물을 많이 주는 상자니까 한번 먹어봐!",
        "유적 던전에는 < 도서관 > 이라는 장소가 있대! 여기에는 강화에 필요한 아이템들이 많이 있다고 하더라고! 한번 조사해볼까?",
        "이봐! 혹시 유적 던전에서 < 떠돌이 상인 > 을 본 적 있어? 매우 적은 확률로 등장한다고 하는데 강화석으로 좋은 아이템들을 구매할 수 있대! 한번 만나볼까?",

        "이봐! [ 이벤트 포탈 ] 이 뭔지 알아? 땅 속에서 광물을 캐다 보면 간혹 등장한다고 해! 포탈을 타고 가면 < 얼티밋 광물 > 과 < 마나석 광물 > 을 채광할 수 있다고 해. 아직 이 광물들에 대해선 설명하지 않을게! 하지만 무지무지 좋은 광물이라는 것! 한번 이벤트 포탈을 타볼까?",
        "이벤트 맵은 어땠어? 뭐..? 너무 짧다고? 하하! 곡괭이 속도를 높이면 괜찮을거야. 그리고 나중에 개방되는 < 마나석 강화 > 로 시간도 늘릴 수 있다고..! 일단 지금은 더 깊이 들어가기 위해 금 장비를 맞추도록 해!",
        "장비를 구매하면 이제 어떻게 한다고? 바로 강화지! 이번에는 < 레전드리 > 등급까지 폭풍 강화를 해보자! 강화 아이템을 사용하면 쉽게 올릴 수 있을거야.",
        "경험치 강화도 꾸준히 해주는 게 중요하지! 뭐..? 알아서 한다고? 그래도 아직 모르는 유저들이 있을거라고..! 보상을 얻고 싶으면 시키는 대로 해!",
        "잘했어! 이제부터는 본격적으로 채광을 시작할거야. < 레전드리 > 등급 광물을 마구마구 캐보자구!",
        "아 맞아! < 일일 퀘스트 > 는 꾸준히 하고 있는거지? 일일 퀘스트를 하면 업적도 동시에 쌓을 수 있고 경험치도 많이 주거든! 한번 해보는게 어때?",
        "슬슬 다이아 장비를 구매해볼까? 이미 구매했다면... 그건 네가 잘했다는 거야!",
        "드디어 20강..! 20강부터는 한계 돌파를 의미하는 < 얼티밋 > 등급이 돼! 재밌는건 이 게임은 강화에 제한이 없다는 거지! 어디 한번 얼티밋 등급으로 올려 볼까?",

        "로비에 [ 광산 ] 버튼이 활성화 됐어! 광산에서는 펫에 관련된 시스템을 사용할 수 있어! 펫은 네가 게임을 안해도 < 광물 > 과 < 아이템 > 을 자동으로 모아주는 [ 방치형 ] 요소야! 뭐? 펫은 어디서 얻냐고? 좋은 질문이야! 펫은 다양한 곳에서 얻을 수 있지! 그 중에서 < 킹슬라임 > 이라는 보스 몬스터가 있지. 그럼 직접 처치해볼까?",
        "킹슬라임을 처치하면 < 펫 > 을 높은 확률로 드랍할 수 있지! 이번에는 더 많은 펫들을 모아보자!",
        "이제 어느 정도 펫들을 모았으니 일을 시켜야겠지? [ 광산 ] 으로 들어가 오른쪽 메뉴 중 첫번째 버튼을 눌러봐! 그러면 펫을 현장에 배치하여 일을 시킬 수 있어, 한번 해봐!",
        "잘했어! 이번에는 먹이를 줘볼까? [ 광산 ] 으로 들어가 오른쪽 메뉴 중 두번째 버튼을 눌러봐! 먹이를 주면 < 펫 레벨 > 이 늘어나 보상 시간이 짧아지고 더 많은 아이템을 가져다 주거든.",
        "이번에는 펫을 합성해볼까? [ 광산 ] 으로 들어가 오른쪽 메뉴 중 세번째 버튼을 눌러봐! 합성을 하면 < 펫 등급 > 을 높일 수 있어! 하지만 실패할수도 있지.",
        "좋았어! 이번에는 펫 강화를 해보자! [ 광산 ] 으로 들어가 오른쪽 메뉴 중 네번째 버튼을 눌러봐!",
        "이제 [ 펫 시스템 ] 에 대해서 이해가 됐어? 마지막으로 펫이 가져온 상자를 열어보자..!",

        "광산에 [ 펫 하우스 ] 버튼이 활성화 됐어! [ 펫 하우스 ] 는 [ 광산 ] 에서 좌측 하단에 < 저택 > 아이콘을 누르면 확인할 수 있어! 처음으로 펫 하우스 보상을 받아볼까?",
        "음..? 보상이 맛이 없다고? 하하! 당연하지! 펫 하우스 레벨이 고작 < 1 레벨 > 이잖아! 펫 하우스 레벨을 높일수록 모든 펫들의 효율이 증가하고 보상도 좋아져! 그럼 펫 하우스 레벨을 올려볼까?",
        "자, 이제 펫 하우스에서 구매할 수 있는 첫번째 요소! < 마나석 버프 > 에 대해 알려줄게! 마나석 버프는 < 마나석 > 을 지불하여 얻을 수 있는 버프야! 한번 구매해서 받아볼까?",
        "어때? 대단한 효과지 않아? 이번에는 < 마나석 아이템 > 을 구매해보자!",
        "만약 급한 아이템이 필요하다면 마나석으로 구매하면 좋아! 이번에는 < 마나석 강화 > 에 대해 알려줄게! 이건 정말로 중요한 부분이야! < 특수 효과 > 를 강화해주기 때문이지! 네가 원하는 효과를 강화해봐.",
        "아주 잘 따라오고 있어! 이제 다시 채광에 집중해볼까? 그 전에 채광을 위한 준비를 해야겠지?",
        "그 다음에는 강화석 강화으로 장비 효과를 높이자! 앞으로는 험난한 채광이 될거라구..!",
        "오랜만에 광물들을 채광해볼까? 이제 이정도 양은 껌이지! 안 그래, 파트너?",
        "간단하게 마나석도 드랍해서 모아볼까? 마나석의 중요함을 깨달았으니까! 대신, 직접 드랍으로만 인정할거야!",

        "인벤토리에서 [ 아이템 합성 ] 버튼이 활성화 됐어! 쓸모 없는 아이템들을 합성하여 < 전설의 영약 > 과 < 제련석 > 을 얻을 수 있지! 한번 물약을 합성해볼래?",
        "어때! 결과는 좋았어? 뭐..? 별로라고? 그건 네가 운이 없었던 걸지도... 하하..! 나중에 물약이 넘쳐나면 그때 해도 괜찮아! 이번에는 강화 아이템을 합성해볼까?",

        "파트너! 그거 알아? 지하 깊은 곳에는 새로운 세계가 펼쳐져 있대! 듣기로는 < 나무 > 와 < 골렘 > 이 잔뜩 있다고 하던데, 궁금하지 않아? 가기 전에 < 청록석 곡괭이 > 를 구매하자!",
        "골렘을 본 적 있어? 미니 골렘부터 시작해서 거대 골렘이 있지! 한번 처치해볼까?",
        "강한 녀석은 엄청 강하네! 그럼 이번에는 나무를 부숴볼까? 거대 나무도 있는데 그걸 부수려면 좀 힘들걸!",
        "잘했어! 그나저나 여기부턴 왜 이렇게 박쥐가 많은 거야? 걸리적거리니 처리하자!",
        "그나저나 혹시 [ 고대 던전 ] 을 본 적이 있어? 입구에 해골이 엄청 쌓여있던데! 엄청 위험한 곳 인가봐. 궁금한데 한번 들어가보자!",
        "어두워! 너무 어둡잖아! 거기다가 엄청 위험해 보이는 녀석들까지... 일단 녀석들을 처리하자",
        "후... 강력한 녀석들이었어! 이런 녀석들이 있다면 분명 엄청난 상자들이 있을 거야! 한번 찾아보자!",
        "좋았어! 그런데 여기는 너무 어두워서 횃불이 필수야! 던전 내부에 횃불이 많던데 사용해보자!",
        "이제는 어느 정도 적응 했네! 내가 들은 바로는 고대 던전에는 < 황금 상자 > 가 있다고 하더라구! 한번 찾아볼까?!",
        "소문대로 엄청 나네..! 그나저나 지하에서 거대한 울음소리가 들리는 것 같은데... 이 던전의 주인인가? 후후... 어떤 녀석일지 궁금한데!",
        "와! 보상이 엄청 좋잖아?! < 레드 다이아 > 까지 주다니 땡잡았네! 앞으로 고대 던전이 나오면 무조건 들러야겠어! 그나저나 오랫 동안 채광을 하지 않았는데 오랜만에 실력을 뽐내볼까?",
        "이제는 레전드리 광물로 돈 벌기 쉽지 않네... < 얼티밋 > 광물을 노려볼까?",
        "역시 얼티밋 광물이야! 돈이 훨씬 더 많이 벌리잖아? 이 기세를 몰아서 오랜만에 경험치 강화를 해야겠어!",
        "좋았어! 경험치 강화는 이걸로 만족이야! 이번에는 강화석 강화를 해보자!",

        "이제부터 너는 이 게임의 숙련자야! 내가 가르쳐줄 부분은 없겠어! 앞으로 무운을 빈다구, 파트너! 먼저 < 영혼석 곡괭이 > 를 구매해서 8층으로 진입하자!",
        "8층에도 왔으니 레전드리 광물을 마구마구 캐볼까?!",
        "8층의 얼티밋 광물은 뭐가 있을까?! 한번 알아보자!",
        "8층에서 살아남기 위해선 마나석을 많이 모아야지!",
        "아무래도 마나석이 너무 부족한 것 같다고 생각하지 않아? < 마나석 강화 > 에서 < 마나석 채굴꾼의 정신 > 을 강화하여 더 많은 마나석을 캘 수 있도록 준비하자!",
        "이제부터 마나석이 좀 더 많이 캘 수 있어! 손풀기로 마나석 좀 캐볼까?",
        "8층에서 좀 더 쉽게 살아남으려면 경험치 강화를 더 많이 해야 할 것 같아!",
        "8층에서 좀 더 쉽게 살아남으려면 강화석 강화를 더 많이 해야 할 것 같아!",

        "< 흑마석 곡괭이 > 를 구매해서 9층으로 진입하자!",
        "9층에도 왔으니 레전드리 광물을 마구마구 캐볼까?!",
        "9층의 얼티밋 광물은 뭐가 있을까?! 한번 알아보자!",
        "9층에서 살아남기 위해선 마나석을 많이 모아야지!",
        "컬렉션에 대해 욕심이 생기지 않아? < 마나석 강화 > 에서 < 컬렉터의 정신 > 을 강화하여 더 많은 컬렉션 카드를 얻을 수 있도록 준비하자!",
        "이제부터 컬렉션 카드를 좀 더 많이 얻을 수 있어! 손풀기를 시작해볼까?",
        "손풀기는 이제 끝이야! 이제 본격적으로 컬렉션 카드를 모아보자!",
        "아직도 부족한 것 같은데..? 나는 플로어 컬렉션 효과를 모두 받고 싶다고! 더 많이 캐보자!",
        "9층에서 좀 더 쉽게 살아남으려면 경험치 강화를 더 많이 해야 할 것 같아!",
        "9층에서 좀 더 쉽게 살아남으려면 강화석 강화를 더 많이 해야 할 것 같아!",

        "< 태초석 곡괭이 > 를 구매해서 10층으로 진입하자!",
        "10층에도 왔으니 레전드리 광물을 마구마구 캐볼까?!",
        "10층의 얼티밋 광물은 뭐가 있을까?! 한번 알아보자!",
        "10층에서 살아남기 위해선 마나석을 많이 모아야지!",
        "내 생각에는 마나석 비용이 너무 많이 들어가는 것 같은데..? 보스를 잡으면서 더 모아볼까? < 마나석 강화 > 에서 < 보스 사냥꾼의 정신 > 을 강화하여 더 많은 마나석을 얻을 수 있도록 준비하자!",
        "이제부터 보스를 좀 더 많이 잡아야 겠는걸! 손풀기를 시작해볼까?",
        "손풀기는 이제 끝이야! 이제 본격적으로 보스를 사냥해보자!",
        "아직도 부족한 것 같은데..? 여기서 끝내기엔 강화가 아깝다구! 더 많이 처치해보자!",
        "10층에서 좀 더 쉽게 살아남으려면 경험치 강화를 더 많이 해야 할 것 같아!",
        "10층에서 좀 더 쉽게 살아남으려면 강화석 강화를 더 많이 해야 할 것 같아!",

        "< 연옥석 곡괭이 > 를 구매해서 11층으로 진입하자!",
        "11층에도 왔으니 레전드리 광물을 마구마구 캐볼까?!",
        "11층의 얼티밋 광물은 뭐가 있을까?! 한번 알아보자!",
        "11층에서 살아남기 위해선 마나석을 많이 모아야지!",
        "그거 알아, 파트너? 11층부터는 < 미스틱 광물 > 이 등장한데! 얼티밋보다 훨씬 비싼 광물! 그걸 노려보자. < 마나석 강화 > 에서 < 미스틱 사냥꾼의 정신 > 을 강화하여 더 많은 미스틱 광물을 얻을 수 있도록 준비하자!",
        "좋아, 비싼 값을 지불한만큼 미스틱 광물을 찾으러 다녀보자고! 손풀기를 시작해볼까?",
        "손풀기는 이제 끝이야! 이제 본격적으로 미스틱을 캐보자!",
        "이 정도로는 11층으로 갈 수 없겠는걸..? 더 많이 찾으러 다녀야겠어!",
        "11층에서 좀 더 쉽게 살아남으려면 경험치 강화를 더 많이 해야 할 것 같아!",
        "11층에서 좀 더 쉽게 살아남으려면 강화석 강화를 더 많이 해야 할 것 같아!",

        "< 육천석 곡괭이 > 를 구매해서 12층으로 진입하자!",
        "12층에도 왔으니 레전드리 광물을 마구마구 캐볼까?!",
        "12층의 얼티밋 광물은 뭐가 있을까?! 한번 알아보자!",
        "12층에서 살아남기 위해선 마나석을 많이 모아야지!",
        "그런데 파트너는 펫에 신경을 쓰고 있어? 우리 같은 랭커들에겐 펫이 효율이 좋다고 하더라구! < 마나석 강화 > 에서 < 펫 연금술사의 정신 > 을 강화하여 더 높은 등급의 펫을 얻을 수 있도록 준비하자!",
        "크흑..! 강화 비용이 엄청 비싸네..! 하지만 그만큼 효과는 좋겠지? 손풀기를 시작해볼까?",
        "손풀기는 이제 끝이야! 이제 본격적으로 펫을 합성해보자!",
        "이 정도로는 최고의 펫 팀을 만들 수 없어! 엄청나게 합성해주지!",
        "12층에서 좀 더 쉽게 살아남으려면 경험치 강화를 더 많이 해야 할 것 같아!",
        "12층에서 좀 더 쉽게 살아남으려면 강화석 강화를 더 많이 해야 할 것 같아!",

        "< 천계석 곡괭이 > 를 구매해서 13층으로 진입하자!",
        "13층에도 왔으니 레전드리 광물을 마구마구 캐볼까?!",
        "13층의 얼티밋 광물은 뭐가 있을까?! 한번 알아보자!",
        "13층에서 살아남기 위해선 마나석을 많이 모아야지!",
        "파트너, 미스틱 광물은 잘 나오고 있어? 뭐..? 딱히 눈에 띄지 않는다고? 그러면 안 돼! 지금부터는 미스틱 광물이 중요하다고! < 마나석 강화 > 에서 < 미스틱 사냥꾼의 정신 > 을 더욱 강화하자!",
        "미스틱을 캐기 위한 준비는 완벽하지? 그럼 시작해볼까?!",
        "잘하는걸~! 하지만 아직 멀었어! 더욱 많이 캐서 사람들에게 자랑하자고!",
        "엄청 많이 캤는걸, 파트너! 그냥 이 세상의 모든 미스틱 광물을 캐보는 건 어때?",
        "13층에서 좀 더 쉽게 살아남으려면 경험치 강화를 더 많이 해야 할 것 같아!",
        "13층에서 좀 더 쉽게 살아남으려면 강화석 강화를 더 많이 해야 할 것 같아!",

        "< 공허석 곡괭이 > 를 구매해서 14층으로 진입하자!",
        "14층의 얼티밋 광물은 뭐가 있을까?! 한번 알아보자!",
        "14층의 미스틱 광물은 뭐가 있을까?! 한번 알아보자!",
        "14층에서 살아남기 위해선 마나석을 많이 모아야지!",
        "그거 알아? 최근에 미스틱(M) 등급의 펫이 등장했대! 최고의 펫 성능을 위해 < 펫 강화 > 를 해보자!",
        "미스틱(M) 등급의 펫을 영접할 준비가 끝났네! 어디 한 번 미스틱(M) 등급의 펫을 만들어볼까?",
        "좋았어! 미스틱(M) 등급의 펫은 대단하구나! 조금 더 많이 만들어보자!",
        "잘했어! 이렇게 된 거 이 게임의 최고 펫 조련사가 되어볼까?!",
        "14층에서 좀 더 쉽게 살아남으려면 경험치 강화를 더 많이 해야 할 것 같아!",
        "14층에서 좀 더 쉽게 살아남으려면 강화석 강화를 더 많이 해야 할 것 같아!",

        "< 서플리스 곡괭이 > 를 구매해서 15층으로 진입하자!",
        "그거 알아? 15층부터는 레드 다이아를 주는 붉은 나무가 존재한대! 한번 살펴볼까?!",
        "이번에는 레드 다이아 나무를 지키는 골렘을 잡아보자!",
        "15층의 얼티밋 광물은 뭐가 있을까?! 한번 알아보자!",
        "15층의 미스틱 광물은 뭐가 있을까?! 한번 알아보자!",
        "혹시 [ 성장하는 돌 ] 알아? 성장하는 돌은 매우 얻기 힘들지만 엄청나게 비싼 돌이야! 이번에는 성장하는 돌을 모아보자!",
        "좋았어! 이번에는 성장하는 돌을 좀 더 모아볼까?",
        "잘했어! 이렇게 된 거 이 세상에 존재하는 성장하는 돌을 모두 얻어보자!",
        "15층에서 좀 더 쉽게 살아남으려면 경험치 강화를 더 많이 해야 할 것 같아!",
        "15층에서 좀 더 쉽게 살아남으려면 강화석 강화를 더 많이 해야 할 것 같아!",
    };
    private static string[] infos2 =
    {
        "!! 목표 : 땅 블록 20개 캐기 !!",
        "!! 목표 : 노멀 등급 광물 10개 캐기 !!",
        "!! 목표 : 아무 몬스터 3마리 처치 !!",
        "!! 목표 : 일반 던전 상자 1개 열기 !!",

        "!! 목표 : 10,000원 벌기 !!",
        "!! 목표 : 모든 돌 장비(곡괭이, 모자, 반지, 목걸이, 검) 모두 구매 !!",
        "!! 목표 : 레어 등급 광물 10개 캐기 !!",

        "!! 목표 : 목걸이 경험치 강화 1회 !!",
        "!! 목표 : 현재 착용한 모든 장비(곡괭이, 모자, 반지, 목걸이, 검) 레어(4성) 등급으로 강화 !!",

        "!! 목표 : 업적 달성 10회 !!",
        "!! 목표 : 업적 티어 보상 1회 !!",

        "!! 목표 : 컬렉션 카드 5회 획득 !!",
        "!! 목표 : 모든 철 장비(곡괭이, 모자, 반지, 목걸이, 검) 모두 구매 !!",
        "!! 목표 : 현재 착용한 모든 장비(곡괭이, 모자, 반지, 목걸이, 검) 에픽(8성) 등급으로 강화 !!",
        "!! 목표 : 경험치 강화 5회 !!",
        "!! 목표 : 에픽 광물 10개 캐기 !!",

        "!! 목표 : 아무 종류의 물약 아이템 1회 사용 !!",
        "!! 목표 : 아무 종류의 강화 아이템 1회 사용 !!",
        "!! 목표 : 유적 던전 1회 입장 !!",
        "!! 목표 : 유적 몬스터 3마리 처치 !!",
        "!! 목표 : 유적 던전 상자 1회 열기 !!",
        "!! 목표 : 도서관 3회 조사 !!",
        "!! 목표 : 유적 NPC 상인 1회 만나기 !!",

        "!! 목표 : 이벤트 포탈 1회 이용 !!",
        "!! 목표 : 모든 금 장비(곡괭이, 모자, 반지, 목걸이, 검) 모두 구매 !!",
        "!! 목표 : 현재 착용한 모든 장비(곡괭이, 모자, 반지, 목걸이, 검) 레전드리(16성) 등급으로 강화 !!",
        "!! 목표 : 경험치 강화 10회 !!",
        "!! 목표 : 레전드리 광물 10개 캐기 !!",
        "!! 목표 : 일일 퀘스트 3회 수행 !!",
        "!! 목표 : 모든 다이아 장비(곡괭이, 모자, 반지, 목걸이, 검) 모두 구매 !!",
        "!! 목표 : 현재 착용한 모든 장비(곡괭이, 모자, 반지, 목걸이, 검) 얼티밋(20성) 등급으로 강화 !!",

        "!! 목표 : 킹슬라임 1마리 처치 !!",
        "!! 목표 : 아무 펫 3마리 드랍 !!",
        "!! 목표 : 아무 펫 3마리 필드 배치 !!",
        "!! 목표 : 펫 먹이주기 3회 !!",
        "!! 목표 : 펫 합성 3회 !!",
        "!! 목표 : 펫 강화 3회 !!",
        "!! 목표 : 펫 상자 1회 열기 !!",

        "!! 목표 : 펫 하우스 보상 1회 받기 !!",
        "!! 목표 : 펫 하우스 레벨 10 달성 !!",
        "!! 목표 : 마나석 버프 3회 구매 !!",
        "!! 목표 : 마나석 아이템 5회 구매 !!",
        "!! 목표 : 마나석 강화 10회 구매 !!",
        "!! 목표 : 모든 흑암석 장비(곡괭이, 모자, 반지, 목걸이, 검) 모두 구매 !!",
        "!! 목표 : 현재 착용한 모든 장비(곡괭이, 모자, 반지, 목걸이, 검) 강화석 강화 30성 달성 !!",
        "!! 목표 : 레전드리 광물 100개 캐기 !!",
        "!! 목표 : 마나석 300개 드랍 획득 !!",

        "!! 목표 : 물약 아이템 5회 합성 !!",
        "!! 목표 : 강화 아이템 5회 합성 !!",

        "!! 목표 : 청록석 곡괭이 구매 !!",
        "!! 목표 : 골렘 20마리 처치 !!",
        "!! 목표 : 나무 20개 부수기 !!",
        "!! 목표 : 박쥐 몬스터 5마리 처치 !!",
        "!! 목표 : 고대 던전 1회 입장 !!",
        "!! 목표 : 고대 던전 몬스터 10마리 처치 !!",
        "!! 목표 : 고대 던전 상자 5회 열기 !!",
        "!! 목표 : 고대 던전 횃불 3회 사용 !!",
        "!! 목표 : 고대 황금 상자 1회 열기 !!",
        "!! 목표 : 고대 던전 보스 1마리 처치 !!",
        "!! 목표 : 레전드리 광물 500개 캐기 !!",
        "!! 목표 : 얼티밋 광물 20개 캐기 !!",
        "!! 목표 : 모든 장비 경험치 강화 15렙 달성 !!",
        "!! 목표 : 현재 착용한 모든 장비(곡괭이, 모자, 반지, 목걸이, 검) 강화석 강화 100성 달성 !!",

        "!! 목표 : 영혼석 곡괭이 구매 !!",
        "!! 목표 : 레전드리 광물 1000개 캐기 !!",
        "!! 목표 : 얼티밋 광물 50개 캐기 !!",
        "!! 목표 : 마나석 1000개 드랍 획득 !!",
        "!! 목표 : 마나석 도굴꾼의 정신 10레벨 달성 !!",
        "!! 목표 : 마나석 3000개 드랍 획득 !!",
        "!! 목표 : 모든 장비 경험치 강화 20렙 달성 !!",
        "!! 목표 : 현재 착용한 모든 장비(곡괭이, 모자, 반지, 목걸이, 검) 강화석 강화 500성 이상 !!",

        "!! 목표 : 흑마석 곡괭이 구매 !!",
        "!! 목표 : 레전드리 광물 1500개 캐기 !!",
        "!! 목표 : 얼티밋 광물 100개 캐기 !!",
        "!! 목표 : 마나석 5000개 드랍 획득 !!",
        "!! 목표 : 컬렉터의 정신 30레벨 달성 !!",
        "!! 목표 : 컬렉션 카드 111개 획득 !!",
        "!! 목표 : 컬렉션 카드 222개 획득 !!",
        "!! 목표 : 컬렉션 카드 333개 획득 !!",
        "!! 목표 : 모든 장비 경험치 강화 30렙 달성 !!",
        "!! 목표 : 현재 착용한 모든 장비(곡괭이, 모자, 반지, 목걸이, 검) 강화석 강화 1000성 이상 !!",

        "!! 목표 : 태초석 곡괭이 구매 !!",
        "!! 목표 : 레전드리 광물 2000개 캐기 !!",
        "!! 목표 : 얼티밋 광물 200개 캐기 !!",
        "!! 목표 : 마나석 30k개 드랍 획득 !!",
        "!! 목표 : 보스 사냥꾼의 정신 50레벨 달성 !!",
        "!! 목표 : 아무 보스 몬스터 33마리 처치 !!",
        "!! 목표 : 아무 보스 몬스터 66마리 처치 !!",
        "!! 목표 : 아무 보스 몬스터 99마리 처치 !!",
        "!! 목표 : 모든 장비 경험치 강화 50렙 달성 !!",
        "!! 목표 : 현재 착용한 모든 장비(곡괭이, 모자, 반지, 목걸이, 검) 강화석 강화 3000성 이상 !!",

        "!! 목표 : 연옥석 곡괭이 구매 !!",
        "!! 목표 : 레전드리 광물 3000개 캐기 !!",
        "!! 목표 : 얼티밋 광물 300개 캐기 !!",
        "!! 목표 : 마나석 100k개 드랍 획득 !!",
        "!! 목표 : 미스틱 사냥꾼의 정신 100레벨 달성 !!",
        "!! 목표 : 미스틱 광물 33개 캐기 !!",
        "!! 목표 : 미스틱 광물 66개 캐기 !!",
        "!! 목표 : 미스틱 광물 99개 캐기 !!",
        "!! 목표 : 모든 장비 경험치 강화 100렙 달성 !!",
        "!! 목표 : 현재 착용한 모든 장비(곡괭이, 모자, 반지, 목걸이, 검) 강화석 강화 10k성 이상 !!",

        "!! 목표 : 육천석 곡괭이 구매 !!",
        "!! 목표 : 레전드리 광물 4000개 캐기 !!",
        "!! 목표 : 얼티밋 광물 500개 캐기 !!",
        "!! 목표 : 마나석 300k개 드랍 획득 !!",
        "!! 목표 : 펫 연금술사의 정신 30레벨 달성 !!",
        "!! 목표 : U 등급 펫 10마리 합성 !!",
        "!! 목표 : UU 등급 펫 10마리 합성 !!",
        "!! 목표 : UUU 등급 펫 10마리 합성 !!",
        "!! 목표 : 모든 장비 경험치 강화 300렙 달성 !!",
        "!! 목표 : 현재 착용한 모든 장비(곡괭이, 모자, 반지, 목걸이, 검) 강화석 강화 30k성 이상 !!",

        "!! 목표 : 천계석 곡괭이 구매 !!",
        "!! 목표 : 레전드리 광물 5000개 캐기 !!",
        "!! 목표 : 얼티밋 광물 1000개 캐기 !!",
        "!! 목표 : 마나석 1000k개 드랍 획득 !!",
        "!! 목표 : 미스틱 사냥꾼의 정신 500레벨 달성 !!",
        "!! 목표 : 미스틱 광물 333개 캐기 !!",
        "!! 목표 : 미스틱 광물 666개 캐기 !!",
        "!! 목표 : 미스틱 광물 999개 캐기 !!",
        "!! 목표 : 모든 장비 경험치 강화 500렙 달성 !!",
        "!! 목표 : 현재 착용한 모든 장비(곡괭이, 모자, 반지, 목걸이, 검) 강화석 강화 50k성 이상 !!",

        "!! 목표 : 공허석 곡괭이 구매 !!",
        "!! 목표 : 얼티밋 광물 3333개 캐기 !!",
        "!! 목표 : 미스틱 광물 999개 캐기 !!",
        "!! 목표 : 마나석 3333k개 드랍 획득 !!",
        "!! 목표 : 광부 & 모험가 펫 강화 < 시간 단축 & 상자 획득량 증가 > 999 레벨 달성 !!",
        "!! 목표 : 미스틱(M) 등급의 펫 1마리 보유 !!",
        "!! 목표 : 미스틱(M) 등급의 펫 5마리 보유 !!",
        "!! 목표 : 미스틱(M) 등급의 펫 10마리 보유 !!",
        "!! 목표 : 모든 장비 경험치 강화 1000렙 달성 !!",
        "!! 목표 : 현재 착용한 모든 장비(곡괭이, 모자, 반지, 목걸이, 검) 강화석 강화 100k성 이상 !!",

        "!! 목표 : 서플라스 곡괭이 구매 !!",
        "!! 목표 : 레드 다이아 나무 99개 캐기 !!",
        "!! 목표 : 레드 다이아 골렘 99개 잡기 !!",
        "!! 목표 : 얼티밋 광물 6666개 캐기 !!",
        "!! 목표 : 미스틱 광물 3333개 캐기 !!",
        "!! 목표 : 성장하는 돌 1개 캐기 !!",
        "!! 목표 : 성장하는 돌 9개 캐기 !!",
        "!! 목표 : 성장하는 돌 33개 캐기 !!",
        "!! 목표 : 모든 장비 경험치 강화 5000렙 달성 !!",
        "!! 목표 : 현재 착용한 모든 장비(곡괭이, 모자, 반지, 목걸이, 검) 강화석 강화 500k성 이상 !!",
    };
    private static string[] names =
    {
        "일단 땅을 파보자!", "땅 속에는 뭐가 있을까?", "으악! 얘네는 뭐야?!", "상자는 맛있어",
        "돈을 모아 보자!", "이젠 석기 시대야", "반작이는 광물!",
        "경험치 강화가 뭐야?", "강화석 강화는 또 뭐고",
        "이제부터 시작이야!", "맛있는 업적 보상",
        "광물을 캐니 카드가 나와?!", "이젠 철기 시대야", "더 좋은 장비로 강화", "경험치 강화는 중요해", "더더 좋은 광물을 원해!",
        "알록달록 물은 맛있어!", "나는 강화를 강화한다", "새로운 던전(유적 던전) 발견!", "위험한 몬스터가 있었어", "커다란 보물상자도 있어!", "도서관에는 책이 많아", "이건 얼마에요?",
        "이세계로!", "금으로 도배할거야", "강력한 장비를 위해", "경험치를 마구마구 쓰자", "이 광물은 붉은 빛을 내!", "일일 퀘스트는 좋아", "아몬드가 죽으면?", "강화 한계 돌파!",
        "대박 큰 슬라임이잖아!", "내가 잘 키워줄게!", "오늘부터 여기가 네 집이야!", "많이 먹어서 무럭무럭 자라자!", "더 좋은 펫으로 만들어 줄게!", "너를 더 강하게 만들어 줄게!", "그래서 보답은?",
        "펫 하우스에 오신 것을 환영합니다!", "펫 하우스를 넓히자!", "마나석으로 버프 효과를?!", "아이템까지 산다고?!", "특수 능력 강화까지!", "내 오른팔엔...", "더욱 강한 장비로!", "다시 광질을 해볼까?", "파아란 돌맹이",
        "물약을 합쳐보자!", "주문서도 합쳐보자!",

        "세로운 세계야!", "엄청 커다란 돌맹이야 안녕!", "벌목 좀 할게요", "으악! 박쥐잖아?!", "고대 던전 발견!", "여긴 너무 위험해!", "위험하지만 맛있어!", "불은 위대하다", "엄청 비싸보이는 상자다!", "집 주인이세요?", "이번엔 엄청 캘거야!", "뭐지..? 이 비싸보이는 광물은?!", "7층 경험치 강화", "7층 강화석 강화",
        "8층으로 가기 위한 준비", "8층엔 무슨 광물들이 있을까?", "8층 얼티밋 광물을 구경해보자!", "마나석이 필요해", "더 많은 마나석을 캐기 위한 강화", "마나석 사냥꾼!", "8층 경험치 강화", "8층 강화석 강화",
        "9층으로 가기 위한 준비", "9층엔 무슨 광물들이 있을까?", "9층 얼티밋 광물을 구경해보자!", "마나석이 많이 필요해", "더 많은 컬렉션을 얻기 위한 강화", "광물 컬렉터의 길(1)", "광물 컬렉터의 길(2)", "광물 컬렉터의 길(3)", "9층 경험치 강화", "9층 강화석 강화",
        "10층으로 가기 위한 준비", "10층엔 무슨 광물들이 있을까?", "10층 얼티밋 광물을 구경해보자!", "마나석이 엄청 필요해", "보스 사냥꾼이 되기 위한 강화", "보스 사냥꾼의 길(1)", "보스 사냥꾼의 길(2)", "보스 사냥꾼의 길(3)", "10층 경험치 강화", "10층 강화석 강화",

        "11층으로 가기 위한 준비", "11층엔 무슨 광물들이 있을까?", "11층 얼티밋 광물을 구경해보자!", "마나석이 대박 많이 필요해", "미스틱 채광꾼이 되기 위한 강화", "미스틱 채광꾼의 길(1)", "미스틱 채광꾼의 길(2)", "미스틱 채광꾼의 길(3)", "11층 경험치 강화", "11층 강화석 강화",
        "12층으로 가기 위한 준비", "12층엔 무슨 광물들이 있을까?", "12층 얼티밋 광물을 구경해보자!", "세상 모든 마나석이 필요해", "최고의 펫맘이 되기 위한 강화", "최고의 펫맘의 길(1)", "최고의 펫맘의 길(2)", "최고의 펫맘의 길(3)", "12층 경험치 강화", "12층 강화석 강화",
        "13층으로 가기 위한 준비", "13층엔 무슨 광물들이 있을까?", "13층 얼티밋 광물을 구경해보자!", "저세상의 마나석까지 필요해", "미스틱 광물을 흔한 광물로 만들기 위한 강화", "미스틱의 씨 말리기(1)", "미스틱의 씨 말리기(2)", "미스틱의 씨 말리기(3)", "13층 경험치 강화", "13층 강화석 강화",
        "14층으로 가기 위한 준비", "14층 얼티밋 광물을 구경해보자!", "14층 미스틱 광물을 구경해보자!", "마나석이 엄청 마나", "미스틱 펫 조련사가 되기 위한 준비", "미스틱 펫 조련사(1)", "미스틱 펫 조련사(2)", "미스틱 펫 조련사(3)", "14층 경험치 강화", "14층 강화석 강화",

        "15층으로 가기 위한 준비", "레드 다이아 나무를 벌목하자!", "레드 다이아 골렘을 잡아보자!", "15층 얼티밋 광물을 구경해보자!", "15층 미스틱 광물을 구경해보자!", "성장하는 돌 수집가(1)", "성장하는 돌 수집가(2)", "성장하는 돌 수집가(3)", "15층 경험치 강화", "15층 강화석 강화",
    };
    private static int[] goals =
    {
        20, 10, 3, 1,
        10000, 1, 10,
        1, 4,
        10, 1,
        5, 1, 8, 5, 10,
        1, 1, 1, 3, 1, 3, 1,
        1, 1, 16, 10, 10, 3, 1, 20,
        1, 3, 3, 3, 3, 3, 1,
        1, 10, 3, 5, 10, 1, 30, 100, 300,
        5, 5,
        1, 20, 20, 5, 1, 10, 5, 3, 1, 1, 500, 20, 15, 100, // 7층
        1, 1000, 50, 1000, 10, 3000, 20, 500,
        1, 1500, 100, 5000, 30, 111, 222, 333, 30, 1000,
        1, 2000, 200, 30000, 50, 33, 66, 99, 50, 3000,
        1, 3000, 300, 100000, 100, 33, 66, 99, 100, 10000, // 11층
        1, 4000, 500, 300000, 30, 10, 10, 10, 300, 30000,
        1, 5000, 1000, 1000000, 500, 333, 666, 999, 500, 50000,
        1, 3333, 999, 3333333, 999, 1, 5, 10, 1000, 100000,

        1, 99, 99, 6666, 3333, 1, 9, 33, 5000, 500000, // 15층
    };
    private static long[][] rewards =
    {
        new long[] { 200, 100, 0, 0 },
        new long[] { 200, 100, 0, 0 },
        new long[] { 200, 100, 0, 0 },
        new long[] { 200, 100, 0, 0 },

        new long[] { 300, 150, 0, 0 },
        new long[] { 300, 150, 0, 0 },
        new long[] { 300, 150, 0, 0 },

        new long[] { 400, 200, 0, 0 },
        new long[] { 500, 250, 0, 0 },

        new long[] { 600, 300, 0, 0 },
        new long[] { 700, 350, 0, 0 },

        new long[] { 800, 400, 0, 0 },
        new long[] { 800, 400, 0, 0 },
        new long[] { 900, 450, 0, 0 },
        new long[] { 1000, 500, 0, 0 },
        new long[] { 1200, 600, 0, 0 },

        new long[] { 1400, 700, 0, 0 },
        new long[] { 1400, 700, 0, 0 },
        new long[] { 1400, 700, 0, 0 },
        new long[] { 1600, 800, 0, 0 },
        new long[] { 1600, 800, 0, 0 },
        new long[] { 1600, 800, 0, 0 },
        new long[] { 1600, 800, 0, 50 },

        new long[] { 2000, 1000, 0, 0 },
        new long[] { 2000, 1000, 0, 0 },
        new long[] { 2000, 1000, 0, 0 },
        new long[] { 2500, 1200, 0, 0 },
        new long[] { 2500, 1200, 0, 0 },
        new long[] { 2500, 1200, 0, 0 },
        new long[] { 3000, 1500, 0, 0 },
        new long[] { 3000, 1500, 0, 50 },

        new long[] { 3500, 1700, 50, 0 },
        new long[] { 3500, 1700, 50, 0 },
        new long[] { 3500, 1700, 50, 0 },
        new long[] { 3500, 1700, 50, 0 },
        new long[] { 3500, 1700, 50, 0 },
        new long[] { 3500, 1700, 50, 0 },
        new long[] { 3500, 1700, 50, 50 },

        new long[] { 4000, 2000, 50, 0 },
        new long[] { 4000, 2000, 50, 0 },
        new long[] { 4000, 2000, 50, 0 },
        new long[] { 4000, 2000, 50, 0 },
        new long[] { 4000, 2000, 50, 0 },
        new long[] { 5000, 2500, 70, 0 },
        new long[] { 5000, 2500, 70, 0 },
        new long[] { 5000, 2500, 70, 0 },
        new long[] { 5000, 2500, 70, 50 },

        new long[] { 7000, 3500, 100, 0 },
        new long[] { 7000, 3500, 100, 50 },

        // 7층 이후
        new long[] { 10000, 5000, 300, 10 },
        new long[] { 12000, 6000, 350, 10 },
        new long[] { 14000, 7000, 400, 10 },
        new long[] { 16000, 8000, 450, 10 },
        new long[] { 20000, 10000, 500, 10 },
        new long[] { 24000, 12000, 600, 10 },
        new long[] { 28000, 14000, 700, 10 },
        new long[] { 32000, 16000, 800, 10 },
        new long[] { 36000, 18000, 900, 10 },
        new long[] { 40000, 20000, 1000, 10 },
        new long[] { 50000, 25000, 1000, 10 },
        new long[] { 55000, 30000, 1000, 10 },
        new long[] { 60000, 35000, 1000, 10 },
        new long[] { 65000, 40000, 1000, 100 },

        // 8층 이후
        new long[] { 70000, 50000, 2000, 15 },
        new long[] { 75000, 55000, 2000, 15 },
        new long[] { 80000, 60000, 2500, 15 },
        new long[] { 85000, 65000, 3000, 15 },
        new long[] { 90000, 70000, 3500, 15 },
        new long[] { 95000, 75000, 4000, 15 },
        new long[] { 100000, 80000, 4500, 15 },
        new long[] { 100000, 100000, 5000, 100 },

        // 9층 이후
        new long[] { 100000, 100000, 6000, 20 },
        new long[] { 120000, 120000, 6500, 20 },
        new long[] { 140000, 140000, 7000, 20 },
        new long[] { 160000, 160000, 7500, 20 },
        new long[] { 180000, 180000, 8000, 20 },
        new long[] { 200000, 200000, 8500, 20 },
        new long[] { 220000, 220000, 9000, 20 },
        new long[] { 240000, 240000, 9500, 20 },
        new long[] { 260000, 260000, 10000, 20 },
        new long[] { 300000, 300000, 10000, 100 },

        // 10층 이후
        new long[] { 300000, 300000, 20000, 25 },
        new long[] { 400000, 400000, 25000, 25 },
        new long[] { 500000, 500000, 30000, 25 },
        new long[] { 600000, 600000, 35000, 25 },
        new long[] { 700000, 700000, 40000, 25 },
        new long[] { 800000, 800000, 45000, 25 },
        new long[] { 900000, 900000, 50000, 25 },
        new long[] { 1000000, 1000000, 60000, 25 },
        new long[] { 1500000, 1500000, 70000, 25 },
        new long[] { 2000000, 2000000, 80000, 100 },

        // 11층 이후
        new long[] { 3000000, 3000000, 100000, 25 },
        new long[] { 3500000, 3500000, 110000, 25 },
        new long[] { 4000000, 4000000, 120000, 25 },
        new long[] { 4500000, 4500000, 130000, 25 },
        new long[] { 5000000, 5000000, 140000, 25 },
        new long[] { 6000000, 6000000, 150000, 25 },
        new long[] { 7000000, 7000000, 160000, 25 },
        new long[] { 8000000, 8000000, 170000, 25 },
        new long[] { 9000000, 9000000, 180000, 25 },
        new long[] { 10000000, 10000000, 200000, 100 },

        // 12층 이후
        new long[] { 15000000, 15000000, 220000, 30 },
        new long[] { 20000000, 20000000, 240000, 30 },
        new long[] { 25000000, 25000000, 260000, 30 },
        new long[] { 30000000, 30000000, 280000, 30 },
        new long[] { 35000000, 35000000, 300000, 30 },
        new long[] { 40000000, 40000000, 320000, 30 },
        new long[] { 50000000, 50000000, 340000, 30 },
        new long[] { 60000000, 60000000, 360000, 30 },
        new long[] { 70000000, 70000000, 380000, 30 },
        new long[] { 100000000, 100000000, 400000, 100 },

        // 13층 이후
        new long[] { 200000000, 200000000, 500000, 50 },
        new long[] { 250000000, 250000000, 600000, 50 },
        new long[] { 300000000, 300000000, 700000, 50 },
        new long[] { 350000000, 350000000, 800000, 50 },
        new long[] { 400000000, 400000000, 900000, 50 },
        new long[] { 450000000, 450000000, 1000000, 50 },
        new long[] { 500000000, 500000000, 1200000, 50 },
        new long[] { 600000000, 600000000, 1400000, 50 },
        new long[] { 700000000, 700000000, 1600000, 50 },
        new long[] { 1000000000, 1000000000, 2000000, 200 },

        // 14층 이후
        new long[] { 1000000000, 1000000000, 10000000, 100 },
        new long[] { 2000000000, 2000000000, 20000000, 100 },
        new long[] { 3000000000, 3000000000, 30000000, 100 },
        new long[] { 4000000000, 4000000000, 40000000, 100 },
        new long[] { 5000000000, 5000000000, 50000000, 100 },
        new long[] { 6000000000, 6000000000, 60000000, 100 },
        new long[] { 7000000000, 7000000000, 70000000, 100 },
        new long[] { 8000000000, 8000000000, 80000000, 100 },
        new long[] { 9000000000, 9000000000, 90000000, 100 },
        new long[] { 10000000000, 10000000000, 100000000, 500 },

        // 15층 이후
        new long[] { 10000000000, 10000000000, 100000000, 150 },
        new long[] { 20000000000, 20000000000, 200000000, 150 },
        new long[] { 30000000000, 30000000000, 300000000, 150 },
        new long[] { 40000000000, 40000000000, 400000000, 150 },
        new long[] { 50000000000, 50000000000, 500000000, 150 },
        new long[] { 60000000000, 60000000000, 600000000, 150 },
        new long[] { 70000000000, 70000000000, 700000000, 150 },
        new long[] { 80000000000, 80000000000, 800000000, 150 },
        new long[] { 90000000000, 90000000000, 900000000, 150 },
        new long[] { 100000000000, 100000000000, 1000000000, 1000 },
    };

    public Sprite sprite;
    public string info2;
    public new long[] reward; // 0 = 경험치, 1 = 강화석, 2 = 마나석, 3 = 레드 다이아몬드

    public MainQuest(int _list)
    {
        if (!isInit)
        {
            isInit = true;
            sprites = Resources.LoadAll<Sprite>("Images/Main/QuestImages");
        }

        list = _list;
        sprite = sprites[list];
        name = names[list];
        info = infos[list];
        info2 = infos2[list];
        goal = goals[list];
        reward = rewards[list];
    }

    static public int GetStageType(int _list)
    {
        if (_list < 49) return -1;
        else if (_list < 63) return 6;
        else if (_list < 71) return 7;
        else if (_list < 81) return 8;
        else if (_list < 91) return 9;
        else if (_list < 101) return 10;
        else if (_list < 111) return 11;
        else if (_list < 121) return 12;
        else if (_list < 131) return 13;
        else return 14;
    }
}

public class SubQuest : Quest
{
    private static string[][] infos2 =
    {
        // 1층
        new string[] { " 개 > 캐기", " 마리 > 처치", " 개 > 열기", " 개 > 캐기", " 개 > 드랍 획득", " 마리 > 처치"},
        // 3층
        new string[] { " 개 > 캐기", " 마리 > 처치", " 개 > 열기", " 개 > 캐기", " 개 > 드랍 획득", " 마리 > 처치"
            , " 개 > 드랍 획득", " 회 > 이용", " 마리 > 처치", " 개 > 열기", " 회 > 조사", " 회 > 만나기"},
        // 7층
        new string[] { " 개 > 캐기", " 마리 > 처치", " 개 > 열기", " 개 > 캐기", " 개 > 드랍 획득", " 마리 > 처치"
            , " 개 > 드랍 획득", " 회 > 이용", " 마리 > 처치", " 개 > 열기", " 회 > 조사", " 회 > 만나기"
        , " 개 > 부수기", " 마리 > 처치", " 마리 > 처치", " 마리 > 처치", " 개 > 열기", " 마리 > 처치", " 개 > 캐기"},
        // 11층
        new string[] { " 개 > 캐기", " 마리 > 처치", " 개 > 열기", " 개 > 캐기", " 개 > 드랍 획득", " 마리 > 처치"
            , " 개 > 드랍 획득", " 회 > 이용", " 마리 > 처치", " 개 > 열기", " 회 > 조사", " 회 > 만나기"
        , " 개 > 부수기", " 마리 > 처치", " 마리 > 처치", " 마리 > 처치", " 개 > 열기", " 마리 > 처치", " 개 > 캐기", " 개 > 캐기"},
    };
    private static string[][] infos =
{
        // 1층
        new string[] { "아무 광석 < ", "아무 몬스터 < ", "일반 던전 상자 < ", "땅 블록 < ", " 강화석 < ", " 킹슬라임 < "},
        // 3층
        new string[] { "아무 광석 < ", "아무 몬스터 < ", "일반 던전 상자 < ", "땅 블록 < ", " 강화석 < ", " 킹슬라임 < "
            , "마나석 < ", "이벤트 포탈 < ", "유적 던전 몬스터 < ", "유적 던전 상자 < ", "도서관 < ", "NPC 상인 < "},
        // 7층
        new string[] { "아무 광석 < ", "아무 몬스터 < ", "일반 던전 상자 < ", "땅 블록 < ", " 강화석 < ", " 킹슬라임 < "
            , "마나석 < ", "이벤트 포탈 < ", "유적 던전 몬스터 < ", "유적 던전 상자 < ", "도서관 < ", "NPC 상인 < "
        , "나무 < ", "골렘 < ", "박쥐 몬스터 < ", "고대 던전 몬스터 < ", "고대 던전 상자 < ", "고대 던전 보스 < ", "얼티밋 광물 < "},
        // 11층
        new string[] { "아무 광석 < ", "아무 몬스터 < ", "일반 던전 상자 < ", "땅 블록 < ", " 강화석 < ", " 킹슬라임 < "
            , "마나석 < ", "이벤트 포탈 < ", "유적 던전 몬스터 < ", "유적 던전 상자 < ", "도서관 < ", "NPC 상인 < "
        , "나무 < ", "골렘 < ", "박쥐 몬스터 < ", "고대 던전 몬스터 < ", "고대 던전 상자 < ", "고대 던전 보스 < ", "얼티밋 광물 < ", "미스틱 광물 < "},
    };
    private static int[][] goals =
    {
        new int[] { 10, 3, 2, 20, 10, 1 },
        new int[] { 12, 3, 2, 25, 20, 1 },
        // 3층
        new int[] { 14, 4, 3, 30, 30, 1,        10, 1, 3, 3, 3, 1 },
        new int[] { 16, 4, 3, 35, 50, 1,      15, 1, 3, 3, 3, 1 },
        new int[] { 18, 5, 4, 40, 70, 1,      20, 1, 3, 3, 4, 1 },
        new int[] { 20, 5, 4, 45, 100, 1,     30, 1, 3, 3, 4, 1 },
        // 7층
        new int[] { 23, 6, 5, 50, 200, 2,    50, 1, 4, 4, 5, 1,       5, 5, 1, 3, 3, 1, 2 },
        new int[] { 26, 7, 6, 55, 300, 2,   100, 1, 4, 4, 6, 1,       6, 6, 1, 3, 3, 1, 4 },
        new int[] { 29, 8, 7, 60, 500, 2,   250, 1, 5, 5, 7, 1,       7, 7, 1, 3, 3, 1, 6 },
        new int[] { 32, 9, 8, 65, 1000, 2,   500, 1, 5, 5, 8, 1,      8, 8, 1, 3, 3, 1, 8 },
        // 11층
        new int[] { 36, 10, 9, 70, 3000, 3,   1000, 2, 6, 6, 9, 2,   9, 9, 2, 4, 4, 2, 10,        1 },
        new int[] { 40, 11, 10, 80, 5000, 3, 5000, 2, 7, 7, 10, 2,     10, 10, 2, 5, 5, 2, 15,      3 },
        new int[] { 44, 12, 11, 90, 10000, 3, 10000, 2, 8, 8, 11, 2,   11, 11, 2, 6, 6, 2, 20,      5 },
        new int[] { 48, 13, 12, 100, 20000, 3, 20000, 2, 9, 9, 12, 2,   12, 12, 2, 7, 7, 2, 25,      10 },
        // 15층
        new int[] { 60, 15, 15, 150, 50000, 4, 50000, 3, 10, 10, 13, 3,   13, 13, 3, 8, 8, 3, 30,      15 },
    };

    public SubQuest(int _level, int _list)
    {
        level = _level;
        list = _list;
        goal = goals[level][list];
        info = infos[GetSubQuestType(level)][list] + GameFuction.GetNumText(goal) + infos2[GetSubQuestType(level)][list];
    }

    public static int GetSubQuestType(int _level)
    {
        if (_level < 2) return 0;
        else if (_level < 6) return 1;
        else if (_level < 10) return 2;
        else return 3;
    }
}
 